tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1572_tdd.h
#define PWM1OE                        522
#define PWM1CON_OE                    523
#define PWM1EN                        524
#define PWM1CON_EN                    525
#define PWM1INTE                      526
#define PWM1PRIE                      527
#define PWM1INTE_PRIE                 528
#define PWM1DCIE                      529
#define PWM1INTE_DCIE                 530
#define PWM1INTE_PHIE                 531
#define PWM1PHIE                      532
#define PWM1OFIE                      533
#define PWM1INTE_OFIE                 534
#define PWM1INTF                      535
#define PWM1INTF_PRIF                 536
#define PWM1PRIF                      537
#define PWM1INTF_DCIF                 538
#define PWM1DCIF                      539
#define PWM1PHIF                      540
#define PWM1INTF_PHIF                 541
#define PWM1OFIF                      542
#define PWM1INTF_OFIF                 543
#define PWM1CLKCON                    544
#define PWM1CLKCON_CS                 545
#define PWM1CS                        546
#define PWM1CLKCON_CS0                547
#define PWM1CS0                       548
#define PWM1CLKCON_CS1                549
#define PWM1CS1                       550
#define PWM1CLKCON_PS0                551
#define PWM1PS                        552
#define PWM1PS0                       553
#define PWM1CLKCON_PS                 554
#define PWM1PS1                       555
#define PWM1CLKCON_PS1                556
#define PWM1PS2                       557
#define PWM1CLKCON_PS2                558
#define PWM1LDCON                     559
#define PWM1LDCON_LDS0                560
#define PWM1LDS                       561
#define PWM1LDCON_LDS                 562
#define PWM1LDS0                      563
#define PWM1LDCON_LDS1                564
#define PWM1LDS1                      565
#define PWM1LDCON_LDT                 566
#define PWM1LDM                       567
#define PWM1LD                        568
#define PWM1LDCON_LDA                 569
#define PWM1OFCON                     570
#define PWM1OFCON_OFS0                571
#define PWM1OFS                       572
#define PWM1OFCON_OFS                 573
#define PWM1OFS0                      574
#define PWM1OFCON_OFS1                575
#define PWM1OFS1                      576
#define PWM1OFMC                      577
#define PWM1OFCON_OFO                 578
#define PWM1OFM0                      579
#define PWM1OFM                       580
#define PWM1OFCON_OFM0                581
#define PWM1OFCON_OFM                 582
#define PWM1OFM1                      583
#define PWM1OFCON_OFM1                584
#define PWM2PHL_PH                    585
#define PWM2PHL0                      586
#define PWM2PHL                       587
#define PWM2PHL1                      588
#define PWM2PHL2                      589
#define PWM2PHL3                      590
#define PWM2PHL4                      591
#define PWM2PHL5                      592
#define PWM2PHL6                      593
#define PWM2PHL7                      594
#define PWM2PHH0                      595
#define PWM2PHH                       596
#define PWM2PHH_PH                    597
#define PWM2PHH1                      598
#define PWM2PHH2                      599
#define PWM2PHH3                      600
#define PWM2PHH4                      601
#define PWM2PHH5                      602
#define PWM2PHH6                      603
#define PWM2PHH7                      604
#define PWM2DCL_DC                    605
#define PWM2DCL0                      606
#define PWM2DCL                       607
#define PWM2DCL1                      608
#define PWM2DCL2                      609
#define PWM2DCL3                      610
#define PWM2DCL4                      611
#define PWM2DCL5                      612
#define PWM2DCL6                      613
#define PWM2DCL7                      614
#define PWM2DCH0                      615
#define PWM2DCH_DC                    616
#define PWM2DCH                       617
#define PWM2DCH1                      618
#define PWM2DCH2                      619
#define PWM2DCH3                      620
#define PWM2DCH4                      621
#define PWM2DCH5                      622
#define PWM2DCH6                      623
#define PWM2DCH7                      624
#define PWM2PRL0                      625
#define PWM2PRL_PR                    626
#define PWM2PRL                       627
#define PWM2PRL1                      628
#define PWM2PRL2                      629
#define PWM2PRL3                      630
#define PWM2PRL4                      631
#define PWM2PRL5                      632
#define PWM2PRL6                      633
#define PWM2PRL7                      634
#define PWM2PRH0                      635
#define PWM2PRH                       636
#define PWM2PRH_PR                    637
#define PWM2PRH1                      638
#define PWM2PRH2                      639
#define PWM2PRH3                      640
#define PWM2PRH4                      641
#define PWM2PRH5                      642
#define PWM2PRH6                      643
#define PWM2PRH7                      644
#define PWM2OFL                       645
#define PWM2OFL_OF                    646
#define PWM2OFL0                      647
#define PWM2OFL1                      648
#define PWM2OFL2                      649
#define PWM2OFL3                      650
#define PWM2OFL4                      651
#define PWM2OFL5                      652
#define PWM2OFL6                      653
#define PWM2OFL7                      654
#define PWM2OFH                       655
#define PWM2OFH0                      656
#define PWM2OFH_OF                    657
#define PWM2OFH1                      658
#define PWM2OFH2                      659
#define PWM2OFH3                      660
#define PWM2OFH4                      661
#define PWM2OFH5                      662
#define PWM2OFH6                      663
#define PWM2OFH7                      664
#define PWM2TMRL_TMR                  665
#define PWM2TMRL0                     666
#define PWM2TMRL                      667
#define PWM2TMRL1                     668
#define PWM2TMRL2                     669
#define PWM2TMRL3                     670
#define PWM2TMRL4                     671
#define PWM2TMRL5                     672
#define PWM2TMRL6                     673
#define PWM2TMRL7                     674
#define PWM2TMRH_TMR                  675
#define PWM2TMRH                      676
#define PWM2TMRH0                     677
#define PWM2TMRH1                     678
#define PWM2TMRH2                     679
#define PWM2TMRH3                     680
#define PWM2TMRH4                     681
#define PWM2TMRH5                     682
#define PWM2TMRH6                     683
#define PWM2TMRH7                     684
#define PWM2CON                       685
#define PWM2MODE0                     686
#define PWM2MODE                      687
#define PWM2CON_MODE0                 688
#define PWM2CON_MODE                  689
#define PWM2MODE1                     690
#define PWM2CON_MODE1                 691
#define PWM2POL                       692
#define PWM2CON_POL                   693
#define PWM2CON_OUT                   694
#define PWM2OUT                       695
#define PWM2OE                        696
#define PWM2CON_OE                    697
#define PWM2EN                        698
#define PWM2CON_EN                    699
#define PWM2INTE                      700
#define PWM2INTE_PRIE                 701
#define PWM2PRIE                      702
#define PWM2INTE_DCIE                 703
#define PWM2DCIE                      704
#define PWM2INTE_PHIE                 705
#define PWM2PHIE                      706
#define PWM2INTE_OFIE                 707
#define PWM2OFIE                      708
#define PWM2INTF                      709
#define PWM2INTF_PRIF                 710
#define PWM2PRIF                      711
#define PWM2INTF_DCIF                 712
#define PWM2DCIF                      713
#define PWM2INTF_PHIF                 714
#define PWM2PHIF                      715
#define PWM2INTF_OFIF                 716
#define PWM2OFIF                      717
#define PWM2CLKCON                    718
#define PWM2CS0                       719
#define PWM2CS                        720
#define PWM2CLKCON_CS0                721
#define PWM2CLKCON_CS                 722
#define PWM2CLKCON_CS1                723
#define PWM2CS1                       724
#define PWM2CLKCON_PS                 725
#define PWM2CLKCON_PS0                726
#define PWM2PS0                       727
#define PWM2PS                        728
#define PWM2PS1                       729
#define PWM2CLKCON_PS1                730
#define PWM2PS2                       731
#define PWM2CLKCON_PS2                732
#define PWM2LDCON                     733
#define PWM2LDCON_LDS0                734
#define PWM2LDS0                      735
#define PWM2LDCON_LDS                 736
#define PWM2LDS                       737
#define PWM2LDS1                      738
#define PWM2LDCON_LDS1                739
#define PWM2LDM                       740
#define PWM2LDCON_LDT                 741
#define PWM2LD                        742
#define PWM2LDCON_LDA                 743
#define PWM2OFCON                     744
#define PWM2OFS                       745
#define PWM2OFS0                      746
#define PWM2OFCON_OFS0                747
#define PWM2OFCON_OFS                 748
#define PWM2OFCON_OFS1                749
#define PWM2OFS1                      750
#define PWM2OFMC                      751
#define PWM2OFCON_OFO                 752
#define PWM2OFCON_OFM0                753
#define PWM2OFM                       754
#define PWM2OFCON_OFM                 755
#define PWM2OFM0                      756
#define PWM2OFCON_OFM1                757
#define PWM2OFM1                      758
#define PWM3PHL                       759
#define PWM3PHL_PH                    760
#define PWM3PHL0                      761
#define PWM3PHL1                      762
#define PWM3PHL2                      763
#define PWM3PHL3                      764
#define PWM3PHL4                      765
#define PWM3PHL5                      766
#define PWM3PHL6                      767
#define PWM3PHL7                      768
#define PWM3PHH0                      769
#define PWM3PHH                       770
#define PWM3PHH_PH                    771
#define PWM3PHH1                      772
#define PWM3PHH2                      773
#define PWM3PHH3                      774
#define PWM3PHH4                      775
#define PWM3PHH5                      776
#define PWM3PHH6                      777
#define PWM3PHH7                      778
#define PWM3DCL_DC                    779
#define PWM3DCL0                      780
#define PWM3DCL                       781
#define PWM3DCL1                      782
#define PWM3DCL2                      783
#define PWM3DCL3                      784
#define PWM3DCL4                      785
#define PWM3DCL5                      786
#define PWM3DCL6                      787
#define PWM3DCL7                      788
#define PWM3DCH_DC                    789
#define PWM3DCH0                      790
#define PWM3DCH                       791
#define PWM3DCH1                      792
#define PWM3DCH2                      793
#define PWM3DCH3                      794
#define PWM3DCH4                      795
#define PWM3DCH5                      796
#define PWM3DCH6                      797
#define PWM3DCH7                      798
#define PWM3PRL0                      799
#define PWM3PRL                       800
#define PWM3PRL_PR                    801
#define PWM3PRL1                      802
#define PWM3PRL2                      803
#define PWM3PRL3                      804
#define PWM3PRL4                      805
#define PWM3PRL5                      806
#define PWM3PRL6                      807
#define PWM3PRL7                      808
#define PWM3PRH0                      809
#define PWM3PRH_PR                    810
#define PWM3PRH                       811
#define PWM3PRH1                      812
#define PWM3PRH2                      813
#define PWM3PRH3                      814
#define PWM3PRH4                      815
#define PWM3PRH5                      816
#define PWM3PRH6                      817
#define PWM3PRH7                      818
#define PWM3OFL_OF                    819
#define PWM3OFL0                      820
#define PWM3OFL                       821
#define PWM3OFL1                      822
#define PWM3OFL2                      823
#define PWM3OFL3                      824
#define PWM3OFL4                      825
#define PWM3OFL5                      826
#define PWM3OFL6                      827
#define PWM3OFL7                      828
#define PWM3OFH_OF                    829
#define PWM3OFH0                      830
#define PWM3OFH                       831
#define PWM3OFH1                      832
#define PWM3OFH2                      833
#define PWM3OFH3                      834
#define PWM3OFH4                      835
#define PWM3OFH5                      836
#define PWM3OFH6                      837
#define PWM3OFH7                      838
#define PWM3TMRL0                     839
#define PWM3TMRL                      840
#define PWM3TMRL_TMR                  841
#define PWM3TMRL1                     842
#define PWM3TMRL2                     843
#define PWM3TMRL3                     844
#define PWM3TMRL4                     845
#define PWM3TMRL5                     846
#define PWM3TMRL6                     847
#define PWM3TMRL7                     848
#define PWM3TMRH0                     849
#define PWM3TMRH_TMR                  850
#define PWM3TMRH                      851
#define PWM3TMRH1                     852
#define PWM3TMRH2                     853
#define PWM3TMRH3                     854
#define PWM3TMRH4                     855
#define PWM3TMRH5                     856
#define PWM3TMRH6                     857
#define PWM3TMRH7                     858
#define PWM3CON                       859
#define PWM3CON_MODE0                 860
#define PWM3MODE                      861
#define PWM3CON_MODE                  862
#define PWM3MODE0                     863
#define PWM3CON_MODE1                 864
#define PWM3MODE1                     865
#define PWM3CON_POL                   866
#define PWM3POL                       867
#define PWM3CON_OUT                   868
#define PWM3OUT                       869
#define PWM3OE                        870
#define PWM3CON_OE                    871
#define PWM3EN                        872
#define PWM3CON_EN                    873
#define PWM3INTE                      874
#define PWM3PRIE                      875
#define PWM3INTE_PRIE                 876
#define PWM3INTE_DCIE                 877
#define PWM3DCIE                      878
#define PWM3PHIE                      879
#define PWM3INTE_PHIE                 880
#define PWM3INTE_OFIE                 881
#define PWM3OFIE                      882
#define PWM3INTF                      883
#define PWM3PRIF                      884
#define PWM3INTF_PRIF                 885
#define PWM3INTF_DCIF                 886
#define PWM3DCIF                      887
#define PWM3INTF_PHIF                 888
#define PWM3PHIF                      889
#define PWM3INTF_OFIF                 890
#define PWM3OFIF                      891
#define PWM3CLKCON                    892
#define PWM3CLKCON_CS                 893
#define PWM3CS                        894
#define PWM3CS0                       895
#define PWM3CLKCON_CS0                896
#define PWM3CS1                       897
#define PWM3CLKCON_CS1                898
#define PWM3PS0                       899
#define PWM3CLKCON_PS                 900
#define PWM3CLKCON_PS0                901
#define PWM3PS                        902
#define PWM3PS1                       903
#define PWM3CLKCON_PS1                904
#define PWM3PS2                       905
#define PWM3CLKCON_PS2                906
#define PWM3LDCON                     907
#define PWM3LDCON_LDS                 908
#define PWM3LDS0                      909
#define PWM3LDS                       910
#define PWM3LDCON_LDS0                911
#define PWM3LDS1                      912
#define PWM3LDCON_LDS1                913
#define PWM3LDCON_LDT                 914
#define PWM3LDM                       915
#define PWM3LDCON_LDA                 916
#define PWM3LD                        917
#define PWM3OFCON                     918
#define PWM3OFS                       919
#define PWM3OFCON_OFS0                920
#define PWM3OFS0                      921
#define PWM3OFCON_OFS                 922
#define PWM3OFCON_OFS1                923
#define PWM3OFS1                      924
#define PWM3OFMC                      925
#define PWM3OFCON_OFO                 926
#define PWM3OFM0                      927
#define PWM3OFCON_OFM0                928
#define PWM3OFCON_OFM                 929
#define PWM3OFM                       930
#define PWM3OFM1                      931
#define PWM3OFCON_OFM1                932
#define STATUS_SHAD                   933
#define C_SHAD                        934
#define DC_SHAD                       935
#define Z_SHAD                        936
#define WREG_SHAD                     937
#define BSR_SHAD                      938
#define PCLATH_SHAD                   939
#define FSR0L_SHAD                    940
#define FSR0H_SHAD                    941
#define FSR1L_SHAD                    942
#define FSR1H_SHAD                    943
#define STKPTR                        944
#define TOSL                          945
#define TOSH                          946

#endif // _PIC12LF1572_H_
